the
of
given
return
a
and
is
in
an
to
that
are
you
if
integer
array
number
where
with
be
it
each
can
all
for
n
1
from
two
or
any
there
one
0
at
by
not
string
such
as
integers
order
have
on
example
length
-
following
nums
i
same
no
x
has
this
will
only
minimum
0-indexed
may
note
2
maximum
after
value
answer
ith
k
sum
find
than
equal
possible
some
which
s
elements
its
between
then
must
true
first
binary
every
should
also
otherwise
we
more
positive
characters
into
so
left
strings
-1
3
represents
list
right
values
false
exactly
element
make
other
m
time
nodes
ie
index
tree
most
numbers
2d
them
times
empty
contains
both
least
size
int
your
row
different
j
they
valid
node
sequence
representing
their
multiple
letters
when
exists
choose
words
b
character
result
7
count
either
unique
operation
root
arrays
does
column
matrix
sorted
write
distinct
once
do
another
smallest
move
represented
query
total
consists
operations
non-empty
consisting
three
want
type
adjacent
cannot
indices
digits
range
grid
using
class
implement
position
initially
within
key
format
large
returns
since
numsi
contiguous
109
without
largest
less
indicates
modulo
starting
these
path
name
arr
4
new
next
5
last
ii
but
lowercase
considered
set
need
defined
contain
start
containing
table
target
remove
before
c
initializes
greater
even
denotes
substring
object
generated
pair
form
inclusive
get
cell
second
single
above
word
end
subarray
guaranteed
original
difference
remaining
letter
up
consecutive
numbered
primary
y
take
sql
schema
english
longest
means
until
called
function
edges
allowed
add
test
rules
use
input
design
edge
game
respectively
digit
conditions
pairs
reach
connected
change
cells
strictly
non-negative
moves
current
product
id
point
cases
labeled
score
always
subsequence
needed
four
zero
points
distance
while
group
check
leading
however
follows
starts
step
deleting
steps
could
space
assume
amount
void
top
exist
case
was
6
answers
replace
because
positions
very
appear
perform
day
formed
down
used
numsj
possibly
data
graph
ai
square
whose
ways
10
1s
who
way
formally
nums1
changing
queries
answeri
represent
9
increasing
t
bi
num
rows
substrings
would
many
ascending
notice
zeros
person
varchar
xi
present
pick
becomes
returned
absolute
jth
algorithm
takes
delete
structure
resulting
search
ends
edgesi
linked
smaller
d
through
0s
part
appears
odd
required
determine
below
final
head
subarrays
nums2
r
itself
numslength
impossible
undirected
common
place
removing
cost
turn
lexicographically
output
previous
line
task
split
corresponding
shortest
been
solution
children
about
swap
yi
including
still
8
how
moving
non-decreasing
null
complete
good
val
direction
performing
arri
price
like
directly
made
according
representation
process
among
consider
let
alice
maximize
height
equals
convert
separated
along
call
initial
none
32-bit
palindrome
divisible
sort
information
report
types
whether
chosen
out
too
permutation
bottom
people
accepted
groups
average
kth
go
reverse
decimal
become
z
problem
except
already
removed
ordered
----------------------
spaces
prefix
alphabet
divide
apply
boolean
city
optimally
placed
ones
satisfies
p
level
highest
occurs
being
infinite
subsequences
obtained
paths
color
applying
define
coordinates
insert
goal
shown
lower
duplicate
actual
1-indexed
uppercase
over
occurrence
plane
long
code
duplicates
play
bob
board
leaf
lengths
negative
were
construct
child
area
bitwise
obtain
l
occurrences
playing
turns
abc
queriesi
days
written
traversal
wants
ab
trees
subset
those
special
minimize
parentheses
simultaneously
concatenation
si
columns
date
water
added
entire
derived
minutes
currently
system
player
pass
parent
repeat
back
bits
iii
during
players
u
solve
travel
together
fit
outside
beginning
necessarily
xor
complexity
side
e
never
o
rearrange
frequency
unit
lists
forward
ans
corner
seconds
keys
calculate
know
squares
relative
subtree
closest
flip
select
lowest
interval
stones
tie
user
correct
instead
10-5
calls
described
money
connecting
visited
create
partition
employee
build
said
arranged
100
just
see
adding
twice
based
put
directions
customer
suppose
greatest
choosing
needs
taken
replacing
built-in
rectangle
width
stone
receive
expression
addition
results
s1
s2
bottom-right
consist
bst
extra
constraints
divided
per
east
inside
satisfy
vertical
third
concatenated
visit
assigned
front
functions
endi
starti
text
random
he
found
again
under
bit
nth
top-left
invalid
11
circular
repeated
max
follow
mat
describes
upper
changed
adds
vi
larger
full
item
map
leftmost
achieve
prices
followed
signed
merge
located
standing
mentioned
n-1
ansi
denote
names
divisor
road
denoting
stop
coordinate
assign
rotate
sums
location
colors
please
best
buy
------------------------
state
match
v
students
student
nums0
append
units
rounded
done
certain
occur
horizontal
ids
prime
several
filled
arr1
arrlength
exceed
meaning
maximized
power
employees
ui
1st
immediately
pointsi
removes
available
passed
keep
minimized
col
subtract
method
sequences
condition
middle
increment
numsk
wordsi
land
places
backward
gets
west
sentence
longer
nums1i
division
weight
costs
finish
continue
fewer
include
repeating
run
trailing
arrj
intervals
clockwise
scores
rearranging
vertically
pattern
similarly
reads
palindromic
calculated
limit
rest
minute
dictionary
north
south
round
deleted
non-overlapping
friends
123
items
building
wall
floor
x-axis
destination
might
4-directionally
box
modify
diagonal
flips
sign
specific
stops
alternating
directed
iv
zeroes
ending
continuous
12
making
network
encoded
concatenating
depth
counted
fits
runs
moment
seats
his
jump
nearest
vertices
increase
rotation
friend
win
assuming
wins
walk
additional
reaches
properties
foreign
customers
store
-----------------------
users
ri
transform
differ
replaced
x1
queue
room
inserts
o1
cities
higher
rightmost
sell
belongs
horizontally
f
file
constructed
modified
plus
examples
similar
h
permutations
robot
cover
print
inserted
circle
asked
2n
share
swaps
arr0
neighbors
going
having
salary
leaves
2nd
rule
around
stack
suffix
probability
blue
red
base
winner
our
well
meets
solutions
onto
orders
break
leave
work
rotated
matches
due
25
pile
rectangular
seat
randomly
company
intersection
program
belong
speed
denoted
stream
ordering
pay
specifically
version
singly
placing
wait
hold
sorting
played
products
fn
now
w
performed
supports
off
subsets
pointer
-------------------
remains
subtrees
rooted
events
event
created
3rd
additionally
inputs
white
x-y
pricei
degrees
non-zero
constant
-x
etc
transactions
stock
profit
userid
shows
1000
13
covered
later
earliest
arithmetic
piles
uses
lexicographical
collect
had
colored
word2
word1
car
leetcode
double
insertion
bidirectional
cycles
what
lefti
26
holds
combination
decide
high
applied
much
distribute
boxes
dollars
begin
instance
x2
identical
beautiful
center
matching
timei
push
language
support
free
balanced
mark
bool
update
parallel
decided
included
operator
pricesi
vowels
remain
changes
reversed
frequent
heights
period
five
15
serialization
year
overlapping
rank
decreasing
top-right
stay
gridij
hour
counts
arbitrary
indicating
evaluate
maximal
requirements
completely
piece
latest
nothing
open
num2
num1
house
makes
anywhere
image
righti
candies
segment
manager
reorder
say
capacity
sets
traveling
lets
low
coins
0th
read
meet
nums2i
satisfied
arrive
request
implementation
started
a2
decrease
rounds
swapping
tasks
course
triplets
she
generate
taking
y1
pop
multiply
manner
fromi
toi
mapping
rectangles
cut
multiplication
expressions
brackets
231
subsequent
vowel
rearranged
enum
90
stored
across
memory
tasked
numsi1
recall
ranges
help
bank
evaluates
fixed
bottom-left
overlap
slength
pieces
finally
block
source
perfect
houses
accepts
concatenate
versa
vice
rotating
01
associated
island
come
andor
arr2
labels
obstacle
equivalent
preorder
divides
roads
parts
decode
running
comes
chessboard
combinations
received
hours
axis-aligned
factors
answerlength
message
series
reachable
segments
a1
finding
radius
intervalsi
sides
cycle
abcde
queriesj
reconstruct
vertex
card
replacement
weights
pushes
notes
earlier
inserting
alices
stonesi
ensure
20
thus
amongst
in-place
modifying
logs
significant
mean
indicate
black
sold
productid
descending
grouped
forms
missing
able
own
21
explanation
satisfying
half
cardinal
formatted
others
ignored
splitting
nums2j
separate
draw
intersect
contained
kind
reduce
deletion
hand
broken
street
picked
cards
particular
balls
increments
garden
choice
checks
enter
surrounded
shape
descendant
label
costi
factor
far
team
chooses
provided
limited
arrarrlength
country
judge
removal
removals
excluding
boundary
happens
requests
c1
g
courses
indexed
strs
give
future
absx
divisors
anagram
querieslength
deletions
fully
exam
doing
regardless
themselves
olog
record
flipping
triangle
copy
figure
world
321
previously
did
ancestor
disjoint
converted
4th
trip
symbol
collection
alternate
li
lose
loses
subtraction
counting
generates
minimal
30
puzzle
eat
connection
parents
absi
job
passes
cols
individually
stores
analysis
trying
palindromes
equally
23
hhmm
closed
here
endpoints
lines
goes
real
weighted
addint
operators
transaction
ball
optimal
whole
composed
affect
obstacles
candy
wikipedia
food
nor
selected
online
movement
repeatedly
ci
diagonally
simple
1th
completed
toward
towards
public
sit
reached
threshold
testcases
exact
-3
differences
hi
partitioning
independent
earn
drop
22
non-increasing
forming
roots
workers
met
worker
waiting
q
abcd
descendants
visits
lie
opposite
evenly
y2
custom
content
reports
tasksi
101
runtime
encoding
allow
bag
finished
small
necessary
rating
reference
centered
phone
us
definition
underlined
jumps
sequentially
neighboring
timestamp
happy
lead
answer0
answer1
built
nodeval
pushint
rooms
quantity
works
vj
uj
wi
interpreted
converting
tokens
multiplied
variable
evaluation
printed
chunk
reset
website
social
neither
address
50
16
continues
computer
pairsi
triplet
nested
1234
median
criteria
permi
perm
field
occupied
partitions
border
doesnt
104
shorter
partitioned
frequencies
60
valuesi
shift
walking
facing
counterclockwise
arrange
00
0000
else
straight
automatically
away
returning
connects
weighti
secret
wrong
plant
leaving
treat
anagrams
blocks
buildings
shop
pivot
pilesi
appended
walls
parenthesis
constructor
coin
procedure
fill
property
merged
computed
r1
gain
persons
sitting
huge
sale
132
-------------------------
differs
transformation
painted
aa
teams
department
c2
perimeter
nice
server
indirectly
threads
varying
locations
employeeid
sentences
unknown
compute
arrk
writing
shapes
numeric
marked
increases
cars
positioned
her
fourth
ace
chose
answerj
fall
falls
linear
enough
access
arrival
arrives
idi
tile
allows
methods
distances
shares
age
allocate
video
log
mod
station
moved
existing
outgoing
traverse
positioni
trips
bus
standard
meeting
allocated
duration
mapped
specified
simplified
symbols
intermediate
chunks
calculator
-231
internal
api
languages
equation
media
inclusively
daily
activity
blocked
instances
40
14
19
unable
stand
school
environment
serialized
successful
die
logsi
slices
maps
iterator
expected
window
sliding
periods
selling
ranks
arrangement
face
dice
rolls
tests
robots
lost
passengers
infinitely
restrictions
sj
solutionint
likely
24-hour
happen
--
instructions
consecutively
apple
roll
alphabetical
cause
neighbor
security
numsn
detect
preceding
yellow
010
schedule
guess
provide
planted
coming
flowers
i1th
unlock
games
keeping
compare
dot
islands
percentage
matter
outer
gives
beyond
shifting
disconnected
causes
quality
unfortunately
describe
named
magic
token
customerid
milliseconds
arguments
mountain
roadsi
capital
recursively
diagonals
resultant
proven
decoded
container
heighti
yj
calling
possibilities
rearrangement
beauty
root-to-leaf
attack
levels
collected
ladder
further
competition
alphabetically
executed
phrase
servers
messages
booking
thread
cross
crossing
accounts
reformat
alphanumeric
zigzag
conversion
handle
updates
calendar
candidates
tiles
diff
k-th
repeats
downward
y-axis
disturbing
simplicity
direct
visiting
prerequisites
complement
attend
month
spend
opening
parameter
various
components
emails
bags
bi-directional
local
endpoint
restaurant
unless
question
pi
train
typed
keyboard
green
sub
entries
nums1length
formula
calculation
forever
cuts
fair
overall
paint
frog
produce
includes
xth
falling
balance
super
idle
filling
office
supply
sizes
rowi
05
regular
partial
hello
x-coordinate
send
email
sent
kinds
slots
sub-arrays
library
fibonacci
2s
freely
determined
origin
euclidean
nums3
insertint
route
getint
rectanglesi
bobs
ties
separating
degree
ignoring
usual
star
counter
engage
ki
s3
011
constructs
routes
session
rain
validate
seven
500
nine
27
simply
applies
arrows
17
corresponds
desired
known
buffer
seq
strength
spell
initialized
xs
numsl
triple
hasnext
flatten
234
nary-tree
n-ary
topmost
ranking
belonging
endtime
starttimei
starttime
endtimei
jobs
picks
assignment
passenger
postorder
two-dimensional
occurring
mathematical
xy-plane
bounds
finishes
float
stick
visible
non-space
mini
2359
clear
details
averages
eating
grow
night
planning
rob
robber
checker
appends
restricted
decreases
0100
pathsi
flower
entering
recent
inorder
legal
001
compared
lands
gridrc
discount
component
numsnumslength
anything
bad
floors
relationship
searchword
resolve
execution
market
encode
command
travels
recursive
composition
expansion
instantaneously
tickets
rate
status
banned
queens
refer
attributes
solving
section
signifies
besides
him
speedi
key-value
treated
actually
boundaries
orderdate
distribution
shuffled
main
sk
balloons
balloon
generator
constraint
title
hidden
numi
ended
considering
participating
look
paper
picking
pointers
recover
kilometers
skip
dist
appeared
try
machine
denominations
journey
connections
river
crosses
deletes
indicesi
resulti
summation
account
integral
shuffle
configuration
a0
submatrices
numsleft
numsright
my
causing
counter-clockwise
rotations
track
gap
leetcodecom
finds
repetition
splits
happened
assigning
ratio
collide
eats
n2
knight
gcd
interested
remember
labelled
script
themself
indexing
135
sales
productname
root2
root1
dashes
dots
paid
attended
tallest
knows
cant
ten
domain
interface
reversing
spiral
calculates
unoccupied
f1
peak
distancei
eight
connect
acb
avoid
unsorted
questions
wordslength
p1
erasing
representations
reaching
statement
keeps
processed
factorial
undefined
actions
project
tower
view
ever
nums2length
paired
ability
error
better
jumping
tournament
bar
nesting
ugly
baskets
basket
painting
-2
hamming
furthermore
parenti
decrement
acyclic
via
passing
startpos
--------------------------
0-9
domino
valsi
aforementioned
appending
i-th
everyone
login
clock
amounts
getting
distributed
self
unlimited
stations
min
aj
coli
whenever
infected
respective
begins
fraction
dropped
receives
wordsj
quantities
r2
y-coordinate
yields
valuei
shifts
wrapping
net
strange
arr2j
arr1i
colorsi
b2
compressed
bc
turned
minus
folder
files
bitwise-xor
xj
close
continuously
immediate
diagram
therefore
trivially
working
numerical
buses
independently
double-ended
depending
simulate
deque
normal
implemented
stacks
held
delayed
meetings
parser
getrandom
flight
putint
libraries
hash
poor
coefficient
lexicographic
basic
variables
terms
unary
multiplicity
testing
sn
upcoming
requires
wish
preparing
someday
activities
past
elevation
volume
solved
occupy
upper-case
ip
addresses
255
principle
numerals
six
ix
1d
enhances
delivery
pickup
offers
deserialized
restriction
serialize
deserialize
link
alength
years
left-to-right
-9
numsr
absnumsi
rangesi
flattened
res
judged
calculations
merging
pyramid
comprises
plot
covers
plots
ranked
non-intersecting
6-sided
scheduled
profiti
obtaining
di
subgrid
tweet
listinteger
59
tweets
uncolored
touches
decrypt
gridm
grid00
1n
backwards
instruction
simulation
aligned
--------------------
whitespace
arrangements
sticks
blank
mm
reading
eventually
precedence
stays
drives
entirely
forgot
restore
apples
eaten
len
vice-versa
arriving
critical
contact
police
alerting
stashed
heightsi
photo
64-bit
retrieves
32
24
valued
attain
matrices
monotone
difficulty
info
planting
password
unlocks
---------------------------
bought
buying
bloom
pref
objective
staying
occupies
mouse
aab
str1
str2
redundant
cd
marks
completes
exceeds
ride
liters
fuel
short
captured
marking
member
dies
dead
alternately
dividing
queen
positionsi
1-based
dont
collision
collisions
live
seatsi
choices
assumed
genetic
records
cache
directory
xored
targetsum
contrast
in-order
wordlist
excel
sheet
28
conflict
amounti
driving
dollar
drive
departments
departmentid
frequently
swapped
disti
06
i1
bricks
tell
typically
connectionsi
bsts
chain
warehouse
structurally
edgesj
salaries
income
forest
inputoutput
existed
shuffling
majority
odd-indexed
even-indexed
a3
reminder
half-open
successfully
bookint
implementing
3sum
tuples
widths
timesi
312
unchanged
pos
handling
preferred
iterates
partially
managerid
managers
maximizes
axes
boardrc
enters
assert
expectednumslength
expectednumsi
expectednums
assertions
fifth
aec
guards
i0
magical
bef
unrooted
lying
numcourses
prerequisitesi
prerequisite
dates
temperature
favorite
height-balanced
imagine
commas
110
cab
2020
bracket
violating
eventsi
pressed
designed
list1
list2
lies
throws
plants
startvalue
candiesi
members
unsigned
dimensions
aba
arrivali
worked
touching
region
filter
sequential
owner
lock
non
sub-array
display
p2
behind
distributions
spread
spreading
escape
uniquely
reduces
2-d
drawing
finishing
contest
afterward
numsk-1
nums1j
elapsed
loss
movies
movie
effect
flipped
xy
2-dimensional
big
pairings
signal
colori
itemsi
corners
formats
1-9
peoplei
val1
val2
summary
quadruplets
subjected
videos
staircase
pushed
uncommon
fruits
correspond
non-leaf
ranging
obstaclesi
1101
destroyed
reordered
whereas
105
well-formed
logged
context
erase
comprise
34
hire
xn
locked
ancestors
importance
force
dominoes
checked
closing
vals
cpu
costsi
determines
12345
arrleftright
gcdx
primes
asks
chess
individual
contents
truncate
relations
5th
traveled
graphij
graphi
ring
fx
lucky
yyyy-mm-dd
t2
t1
execute
deepest
action
matrixs
0-based
regions
adjacency
selecting
updated
fractional
denominator
reuse
parity
nobody
factory
delay
cutting
device
subgraph
viewed
chars
catch
few
bounded
arr1length
col2
row1
row2
col1
customersi
k-1
pointing
abcc
shared
parentsi
hands
holding
run-length
singly-linked
placement
teacher
aaa
gridrowcol
guarantee
folders
indexi
evaluating
wide
though
ingredients
respect
startrow
press
pays
an-1
s0
weightsi
tells
giving
vali
feed
buckets
losing
climb
75
xi1
matij
show
notation
successive
manhattan
filetxt
listed
movements
sometimes
exchange
lodashs
fnarri
accept
cj
experience
submatrix
callback
completing
operates
fifo
natively
supported
peek
peekpop
half-closed
meetingsi
unused
quote
slash
quotation
removeint
reporting
related
cheapest
flights
removekey
answerx
self-edges
vii
evaluated
term
2x
bac
uniform
shouldnt
trimmed
trim
situated
activitytype
active
trap
trapping
raining
hexadecimal
19216811
ipv4
fulfilled
usually
roman
900
400
xxvii
xii
numeral
xx
iiii
18
traversing
options
queues
preference
referred
prefers
studentsj
reconstructed
transmitted
serializationdeserialization
success
strengths
originally
cousins
numsnumslength-1
incremented
death
birth
population
digitsi
-5
121241510
2510
numsr-1
numsl1
bijection
tested
initialize
inverse
farmland
intersecting
floating
proved
rollsi
index1
index2
youre
scheduling
cherries
cherry
ticket
monitor
freq
recorded
120
210
10000
routine
decrypted
permitted
keysi
puts
monday
save
sunday
tuesday
gridi
halves
eval
forwards
instructed
attempts
pid
attribute
preserving
stamping
stamps
optimize
resets
matrixij
hh
sourcei
yet
effective
interfere
defines
invert
race
commands
supposed
doctors
rotten
os
graphs
spanning
tonight
professional
repetitions
90-degree
movecost
tuple
boomerang
gardens
protected
typing
012
safe
incorrect
entered
345
checking
2k
parameters
specify
joined
faces
selection
borders
images
erased
percent
identify
lower-case
labelsi
sub-tree
skyline
viewing
increased
contour
shaped
citys
eliminate
elimination
powers
answersi
ch
s1i
duplicated
modifications
searches
2h
ideal
coloring
consistent
walked
cat
relation
plate
searchstring
a-b
punctuation
cooldown
promise
asynchronous
reject
lcm
pairing
liter
unrevealed
mines
mine
revealed
appearing
movesi
url
service
drawn
bound
budget
army
enemy
family
someone
kingdom
successor
older
king
coinsi
k-sum
cartesian
grammar
union
e1
rx
e2
ticketsi
taxi
yes
partner
driver
rooks
bishops
rook
bishop
piecesi
wiki
recurse
quad-tree
bottomleft
isleaf
sub-grids
bottomright
sub-grid
terminator
proper
topright
topleft
asteroids
asteroid
efficiency
engineer
speeds
performance
mutate
recently
disconnect
directories
refers
slashes
filedirectory
maxsize
bill
encodedi
classes
shopping
sellerid
buyerid
2019
join
orderid
uniformly
weak
collecting
traversed
collects
warm
cups
cup
endword
beginword
bursting
burst
minimizes
-10
systems
resolved
tied
votes
capitalization
spellchecker
converts
spelling
case-sensitive
case-insensitive
categories
batch
rides
struct
populate
populating
invalidate
maintained
rests
biggest
natural
223
withdrawint
deposit
depositint
withdraw
furthest
ladders
row-wise
js
stonevalue
hit
treesi
aajf
kjf
11106
a-z
grouping
excluded
reserved
firsti
fizzbuzz
buzz
console
prints
printnumber
fizz
x3
bridge
efficient
old
waits
isempty
isfull
rear
redistribute
maxtime
timej
worddict
segmentation
reused
monthly
category
reformatted
yourself
blength
a4
bacd
verifying
sumrangeint
numsindex
numarrayint
numarray
updateint
layers
layer
cyclic
vote
abcba
page
history
browser
tab
mode
sij
0110
words1
words2
inner
logical
iteration
growing
idx
summing
frame
k1
k2
nums2i2
squared
circumference
listnode
objects
stationary
collides
cheese
startj
simulates
curr
snake
knights
guarded
rightward
upon
drops
cook
pushing
prepending
80
things
important
bash
worry
sake
robbing
requirement
vyz
abcdefuvwxyz
nums0i
x0
indirect
temperatures
rising
rootval
ascii
quarter
overlapped
non-null
comma-separated
--------------------------------------
convenience
companys
february
wooden
ant
enddayi
startdayi
installing
rods
slowest
newly
presses
heads
app
followerid
refill
plantsi
watering
stopping
ignore
groupi
profitable
separately
wonderful
triangles
dash
mail
attempt
great
likes
strong
aalength
songs
song
lakes
tripsi
attending
party
infinity
fn-1
f0
intersections
covering
carpetlen
findint
former
latter
maxdistance
week
targets
seed
immutable
growth
locks
skipped
soldiers
ratingi
decomposition
chunked
oranges
fresh
orange
angles
wiggle
chalkboard
advance
safely
spreads
tables
saleid
predict
flat
shot
arrow
diameter
patterns
triangular
stacked
stacking
realized
buttons
gains
layout
multiples
resources
projects
innermost
afterwards
worth
restrictionsi
stands
stocks
pre-order
3d
cubes
million
matched
training
restaurants
filtering
turning
switcher
bulbs
bulb
typei
laser
mirror
optional
truck
comma
transactionsi
carry
carries
bomb
cookies
maxi
ages
scoresi
agesi
4sum
numsb
numsc
numsd
numsa
mid
incomplete
popped
aebdc
aeb
fruit
produces
fruitsi
numrows
pascals
housesi
costij
summer
33
rented
searchint
sure
mass
penalty
widthi
02
const
appropriate
45
faster
situation
optionally
h2o
prefixes
cinema
1100
personid
frogs
landing
powx
shifta
lr
erasure
hits
dropping
spans
parent0
pj
limitj
got
dominoesi
v2
parse
v1
concept
3x
computing
addnumint
unequal
pairwise
lca
contaminated
ik
1337
nextint
scheduler
non-equal
non-digit
flood
pixels
fashion
cipher
108
spent
entry
empid
tx
sx
maze
ty
sy
datetime
mixed
57
describing
solvable
formatting
awesome
-7
strongest
3n
slice
anti-clockwise
pizza
citationsi
citations
published
papers
researchers
researcher
cited
h-index
dag
rings
tilesi
package
235
packages
wasted
waste
f2
f3
transferred
popular
transfer
transfers
incoming
richest
smart
strategy
tweetid
loop
involving
numsk1
numsn-1
0001
coprime
tank
gas
213
minimums
farthest
linked-lists
linked-list
1010
rowj
colj
minitial
malware
bonus
molecule
abbreviated
rational
asterisks
bars
forth
preserved
signs
edit
breaks
unbroken
eggs
egg
certainty
single-threaded
processing
instantly
boy
transformed
align
space-separated
sea
limits
repaired
repair
plan
acceptable
ground
surface
brick
colsum
filtered
multi-dimensional
lot
matrixrowcol
newnumsi
newnums
departs
departure
downwards
cellsi
shiftsi
kept
removeduplicatesnums
requestsi
reside
extract
similarity
smash
tracks
tracker
worst
till
chef
n-queens
post
0190
queryint
efficiently
rope
b1
nums2i1
102
expiration
parents0
-k
playerid
logging
deviceid
gamesplayed
eventdate
namesi
gold
express
fs
divisibility
leftright
lined
advances
outcome
replacements
eee
traffic
1001
parsed
late
eligible
absent
award
attendance
sleftirighti
modifies
ycenter
xcenter
communicate
halve
reduced
2th
creating
grids
took
differing
codes
180
roomsi
entrance
exit
divisions
73
master
reply
gone
arrived
sends
performs
programming
decrements
pad
keyi
deep
finite
cloned
clone
bbb
fee
speciali
manages
designated
floating-point
copies
treenode
274
4237214
242
countint
cream
ice
disappear
convex
polygon
home
startcol
printer
single-space
brings
expressed
extended
button
metal
dial
maxsum
serving
operating
wheel
totally
4567012
0124567
an-2
fleet
one-lane
ahead
miles
examine
tails
internally
numerically
subordinates
fancy
wordlength
meters
port
load
ship
guesses
guessed
retrieve
insertstring
applications
tag
angle
triples
biginteger
ratings
respecting
install
fed
bucket
truncates
025
serve
xi2
fibonacci-like
bug
ij
fewest
leads
boxesi
bs
charged
identified
everybody
flowersi
java
compiler
executing
exclusive
memoized
cached
memoize
targetx
targety
alphabetic
pointslength
transpose
maintain
groupsi
doubled
potentially
relationships
equationsi
equations
stopped
arr2length
slot
vpss
maxdeptha
deptha
vps
depthb
depths
provides
allotted
p0
ansj
gridrowicoli
copied
456
installed
sections
views
news
indexes
i-1th
pig
fi
bj
abcdefghijklmnopqrstuvwxyz
6th
seqlength
seqi
cba
liquid
deck
decki
tour
correctly
exceeding
computers
foo
durationi
uninfected
article
tiling
ranksi
node1
node2
glass
obeys
weakest
jsonparse
capacities
permute
odd-numbered
displays
opponents
extension
reward
picky
machines
processes
energy
sessions
backspace
xxxx
yield
sub-boxes
sudoku
doubly
separation
tic-tac-toe
si1
distributing
skills
skill
init
ccc
compression
compress
throughout
identifier
extending
climbing
stairs
attacking
sensitive
thrown
targeti
definitely
capture
foods
studentid
subjects
subject
university
book
cancelled
replaces
tries
stationsi
successively
influence
totaltrips
x22
y22
myqueue
multiplicand
amp
quot
lt
html
entity
entities
ampersand
frasl
apos
gt
multiset
linearly
randomizedcollection
flightsi
dst
src
myhashmap
hashmap
rededges
rededgesi
blueedgesj
blueedges
46
maxlen
-2aaa
3bb
evalints
well-formatted
5c
-6
evalvars
alternates
3aab
aabc
asterisk
breaking
-1a14
4a
non-star
stars
argument
rand10
rand7
3-same-digit
trimi
kith
xvalue
invertx
0111001
reverseinvertsi
reversex
inverts
011100110110001
s4
freqstack
stack-like
hiker
rows-1
effort
hike
columns-1
heightsrowcol
hope
endsession
activitydate
scrolldown
2019-07-27
sendmessage
opensession
sessionid
heightmap
crossword
queryip
20010db885a38a2e037j7334
20010db885a3000000008a2e03707334
020010db885a3000000008a2e03707334
192168011
19216810
x1x2x3x4x5x6x7x8
2001db885a3008a2e03707334
x1x2x3x4
xilength
ipv6
192168100
iterating
colscount
rowscount
organised
transforms
snailrowscount
snail
pickupdelivery
pickupi
services
deliveryi
sandwiches
sandwich
cafeteria
lunch
sandwichesi
compact
bbabba
bba
bababcba
potionsj
potion
potions
spells
spellsi
bix
numsmiddleindex1
numsmiddleindex2
middleindex
numsmiddleindex-1
reverses
opsi
mxy
ops
deathi
alive
birthi
indexdiff
valuediff
px
iteratorhasnext
nestedlist
iteratornext
nestediteratorlistnestedinteger
pseudocode
nestediterator
careful
barren
farmer
bottommost
apex
pyramidal
fertile
pyramids
purchasedate
enddate
unitssold
averageprice
startdate
holes
ans1
ans0
went
observations
fortunately
observation
numbersindex2
numbersindex1
numberslength
insufficient
airplane
1-bordered
tweetcountsgettweetcountsperfrequencyminute
tweetcountsgettweetcountsperfrequencyhour
36107209
nullnullnullnull221null4
tweetcountsrecordtweettweet3
tweetcounts
site
gettweetcountsperfrequencystring
6060
059
721010000
tweetcountsrecordtweetrecordtweetrecordtweetgettweetcountsperfrequencygettweetcountsperfrequencyrecordtweetgettweetcountsperfrequency
analyzing
3600-second
1010000
1069
0210
tweetname
tweet3
86400-second
frequencys
70129
recordtweet
recordtweetstring
60-second
gettweetcountsperfrequency
130189
tweet30tweet360tweet310minutetweet3059minutetweet3060tweet3120hourtweet30210
103609
997010000
thereafter
pictorial
encrypterchar
encryption
carried
decryption
encrypts
decryptstring
encrypt
encrypter
encryptstring
encrypted
putting
hercy
gridin
alike
closer
queriesith
intlength
stepint
instructs
retries
getpos
awaits
getdir
robotint
2015
longitude
investment
policy
tiv2016
2016
tiv2015
lon
lat
investments
holders
policyholders
insurance
policyholder
latitude
uniquely-sized
13254
stampwidth
stampheight
maxjump
minjump
macros
comments
implicit
comment
control
newline
non-horizontal
uncrossed
accelerate
aar
i2
-100
multiplications
realimaginaryi
imaginary
complex
hourglass
whitespaces
k-diff
daysi
applesi
grows
rot
sided
rolling
idkey
valuelength
osinsert3
ccccc
bbbbb
osinsert5
concatentating
orderedstream
orderedstream5
aaaaa
eeeee
orderedstreamint
osinsert1
osinsert4
osinsert2
ddddd
pseudo-critical
mst
msts
meanwhile
annual
expectedi
complementary
sub-sequence
productofnumbersgetproduct3
productofnumbersadd4
productofnumbersadd5
productofnumbersadd2
3025
productofnumbers
302
productofnumbersaddaddaddaddaddgetproductgetproductgetproductaddgetproduct
productofnumbersgetproduct2
30254
productofnumbersadd0
productofnumbersadd8
nullnullnullnullnullnull20400null32
productofnumbersadd3
getproduct
getproductint
productofnumbersgetproduct4
3025423482
overflowing
302548
havent
inventory
inventoryi
diminishing-valued
weirdly
movecostij
difficulties
jobdifficulty
dependent
jobdifficultyi
boomerangs
matters
xayb
ask
hint
bulls
cows
non-bull
additions
peculiar
012345
cracking
row-traversing
wanted
reshaped
handy
matlab
reshape
2533
version1
version2
revision
revisions
face-up
kn
preserve
translation
translate
img1
img2
translated
k-similar
battleships
separates
battleship
customernumber
ordernumber
0-height
prism
powersj
buys
dcbaefd
abcdefd
s2j
univalued
uni-valued
bouquet
bloomdayi
bloomday
bouquets
fixed-length
self-loops
wordfilter
wordfilterstring
fstring
suff
versions
isbadversionversion
fails
develop
developed
maxvalue
ccatmmouse
catjump
mousejump
transitivity
equivalency
eed
reflexivity
cde
symmetry
equivalence
acd
implies
basestr
s2i
nextlargest
reduction
one-to-one
omit
dinnerplates
dinner
dinnerplatesint
popatstackint
builddictstring
magicdictionary
n-repeated
priority
-ab
ab-
hyphen
hyphens
afad
ba-c
productkey
exceeded
44
max6
max15
selldate
representatives
representative
clickr
minesweeper
click
clickc
char
revealing
magnitude
irrelevant
122
second-largest
third-largest
distinctly
addpatch
patching
patches
shortening
companion
encodedecode
httptinyurlcom4e9iak
shorturl
tiny
tinyurl
encodestring
decodestring
httpsleetcodecomproblemsdesign-tinyurl
longurl
slant
powerful
maxchargetimes
runningcosts
sumrunningcosts
charge
chargetimes
runningcostsi
chargetimesi
forts
fort
maxij
fortsk
minij
fortsi
recyclable
lowfats
fat
parentname
getinheritanceorder
born
kingname
curorder
inheritance
throneinheritancestring
successorxs
jack
oldest
grandchildren
throneinheritance
childname
successorbob
successoralice
whos
well-defined
deathstring
throne
birthstring
successorjack
successorking
successorx
son
gave
wrap-around
comma-delimited
rabc
ra
acdfh
brace
rexpr
rabbc
ek
abefh
acadbcbd
abdfg
acefh
singleton
concatenations
re1
understood
abdfh
re2
acefg
rabcdefgh
rw
rabcd
acdfg
abefg
queuing
numsi-1
driverid
requestat
cancelledbydriver
role
unbanned
cityid
2013-10-03
cancellation
client
cancelledbyclient
2013-10-01
clientid
usersid
canceled
c-1
r-1
understand
quad
explode
introvert
extroverts
introverts
living
introvertscount
happiness
extrovert
extrovertscount
alex
efficiencyi
engineers
5678
5674
1238
startgene
aaccggta
mutation
8-character
mutations
aaccggtt
gene
investigate
endgene
lru
lrucache
evict
lrucacheint
simplify
unix-style
canonical
floored
floornumsi
customstackint
incint
pops
customstack
subtotal
paying
cashierint
amountj
supermarket
purchased
productj
frequented
productsi
getbillint
cashier
groceries
minn
side-length
enrolled
square-free
references
min-product
325
favoritebrand
joindate
itembrand
itemid
buyer
ballsi
carefully
defense
defensej
attacki
attackj
defensei
propertiesi
non-existent
bstiteratortreenode
bstiterator
initializing
grandparent
even-valued
cold
amount1
dispenser
dispense
amount2
hot
amount0
startindex
wisely
introduced
rollmax
rollmaxi
simulator
blacklist
blacklisted
columnnumber
differencesi
hiddeni
cae
bce
lo
243801
243803
803
243
801
voter
voters
position-one
capitlization
yeellow
yllw
errors
handles
yollow
mistakes
ordertypei
ordersi
ordersi1
backlog
tip
willing
tipi
ridesi
earnings
requesting
lfu
lfucacheint
invalidated
lfucache
mistake
kmh
skips
letting
skipping
hoursbefore
absc1
pointsrc
mynumbers
accommodate
rects
rectsi
primefactors
deposits
withdrawing
300
600
prioritizes
atm
banknotescount
banknote
200
rejected
handed
banknotes
pricesj
hi1
column-wise
pre-defined
guessint
ps
server-to-server
connectivity
2xi
pins
player1
player2
bowling
reorganize
2582
3245
treesj
decoding
lasti
bookingsi
corporate
bookings
buzzprintbuzz
fizzbuzzprintfizzbuzz
printfizz
printbuzz
printfizzbuzz
numberprintnumber
multithreaded
fizzprintfizz
fizzbuzzint
xcnti-1
cnti
subdivided
xcnti
subdivide
maxmoves
righttoleftj
lefttorightj
righttolefti
lefttorighti
putnewi
warehouses
pickoldi
regulate
getrear
insertfront
mycirculardequeint
insertlast
deletefront
deletelast
mycirculardeque
getfront
largest-valued
odd-valued
flag
primaryflag
joins
sumnumsi-numsj
k-beauty
20000
50000
accountid
rabbits
rabbit
1-d
serializes
clarification
approaches
creative
patients
diabetes
patientid
hospital
patientname
diab1
arrlefti
arrrighti
repeatlimitedstring
repeatlimit
minalength
ideas
ideab
naming
ideaa
n3
paragraph
superstring
startwords
targetwords
acbd
cbda
2d-array
mutable
mycalendartwo
cyclically
roundsi
sector
rounds0
marathon
circulate
sectors
rounds1
0316227
3627
cast
election
topvotedcandidate
qint
topvotedcandidateint
personsi
3-digit
shifted
neg
left-most
stamp
targetlength
stamped
123450
urllength
backint
browserhistoryvisitgooglecom
browserhistoryforward2
browserhistoryvisitfacebookcom
visitstring
browserhistoryforward1
googlecom
nullnullnullnullfacebookcomgooglecomfacebookcomnulllinkedincomgooglecomleetcodecom
browserhistoryvisityoutubecom
youtubecom
browserhistory
browserhistoryback7
browserhistoryvisitvisitvisitbackbackforwardvisitforwardbackback
homepagelength
leetcodecomgooglecomfacebookcomyoutubecom111linkedincom227
browserhistorystring
forwarding
clears
forwardint
browserhistoryleetcodecom
5000
linkedincom
browserhistoryvisitlinkedincom
facebookcom
browserhistoryback2
browserhistoryback1
homepage
modes
occurred
zeroscolj
onesrowi
diffij
onescolj
zerosrowi
sxy
subexpr2
parsing
subexprn
subexpr1
subexpr
capitalize
capitalized
up-left
hatsi
hats
wear
reinitialize
permn
consuming
graphical
compactly
coincide
bitset
unfixint
fixint
tostring
bitsetint
finalsum
3000
ping
pingint
recentcounter
earning
ratios
brilliant
passi
classesi
beforehand
totali
extrastudents
circlesi
lattice
circles
orderly
serializations
involved
motion
collided
directionsi
reward2
mice
reward2i
reward1
reward1i
-14-13
mincurr
boardn
destinations
boustrophedon
style
snakes
health
princess
fight
decides
laid
quickly
power-ups
imprisoned
dungeon
rescue
valiant
threats
demons
orbs
homogenous
rec1
rec2
touch
targetseconds
startat
microwave
normalized
0954
pushcost
generic
cooking
normalizes
54
finger
99
fatigue
81
interprets
actuallength
removeelementnums
equaling
sortnums
sixth
labelling
pattern0
pattern1
unix
one-line
pipes
sunny
wordstxt
positives
securityi
thieves
duty
gang
p123m
iquerieslength-1
pill
workersj
pills
requiring
strs00
strs0strs0length
strs10
strs01
strs11
strs1strs1length
booleans
most-significant-bit
least-significant-bit
incurred
yesterday
weather
recorddate
sub-nodes
minrootleftval
sub-node
rootrightval
seating
capable
favoritei
invited
organizing
pairslength
endi-1
columntitle
upper-left
streets
janfebmaraprmayjunjulaugsepoctnovdec
revenue
69
444
2019-03-31
unitprice
saledate
2019-01-01
encounter
934126
verify
sentinel
inverting
----
transformations
morse
international
productcategory
upper1
earned
bracketsi
taxes
bracketslength
tax
upper2
upperi
percent2
taxed
upperi-1
upper0
percent0
percent1
percenti
differently
alicevaluesi
bobvaluesi
bobvalues
alicevalues
uniquecnt1
uniquecnt2
divisor2
divisor1
flowerbed
no-adjacent-flowers
plank
ants
skl
gray
n-bit
barcodesi
distant
barcodes
barcode
hasapplei
hasapple
37
89
23489
124789
ors
billboard
welded
steel
installation
weld
keyspressedi
keyspressed
tester
releasetimes
keypresses
keypad
releasetimes0
releasetimesi
released
keypress
splicing
1021
followers
follower
dartboard
darts
dartsi
throwing
dart
threw
early
sqrt2
initialboxes
statusi
containedboxesi
containedboxes
zeroevenodd
evenprintnumber
printnumber7
zeroevenoddint
010203040506
oddprintnumber
zeroprintnumber
cbca
licenseplate
caaacab
abccdef
insensitive
12c
minprofit
crime
participates
scheme
crimes
commit
participate
schemes
abab
ccjjc
subsequence1
subsequence2
e-mails
e-mail
underscore
rightchildi
leftchildi
submissions
mountainarray
mountainarraylength
mountainarraygetk
mountainarrgetindex
circumvent
disqualification
interactive
mountainarr
mountainarrayget
advised
doctor
advice
candytype
candytypei
noticed
progression
presented
violates
bitwise-or
calculatemkaverage
mkaverage
addelementint
mkaverageint
mk
durations
horizontallyvertically
isnt
tape
cdefab
cdabef
efcdab
efabcd
abcdef
acdbef
abefcd
pooling
numpassengersi
vehicle
bean
beans
18291174312
21347112918
chair
targetfriend
leavingi
chairs
fk
arrk1
arrk0
clock-wise
arrkn
leavetimei
floori
numcarpets
carpets
fills
changeint
numbercontainers
iswater
heightij
iswaterij
minima
mindistance
maxima
maximaminima
pickint
saturday
thursday
friday
wednesday
peaks
nums-1
10111
111
smoother
surrounding
rounding
img
grayscale
trios
trio
destroy
seeding
judgement
numzeros
numones
numnegones
numzeroes
-1s
analyze
visitedon
averageamount
acquire
def
dfe
adc
conversions
k-concatenation
84351
2314
turbulent
comparison
decision
brainpoweri
questionsi
brainpower
newinterval
ratingj
ratingk
soldier
subtexti
subtextk
subtext1
subtext2
fix
ababb
elapse
rotting
indiceslength
p3
p4
2-1
cheating
classroom
descent
exempted
smooth
averagearr
averageb
averagea
30-day
costs2
1-day
costs0
costs1
planned
7-day
365
american
zxcvbnm
qwertyuiop
asdfghjkl
fire
stayed
grass
safehouse
evil
sex
temporary
indexs
step-by-step
destvalue
variation
zuma
y-direction
stretches
spherical
y-coordinates
xstart
xend
taped
factorial10
clumsy
clumsy10
three-letter
beneath
aesthetically
transition
pleasing
ransom
magazine
ransomnote
ensures
wrote
seperate
classs
superclass
pac-man
ytarget
ghosts
ghostsi
xtarget
ghost
2-9
telephone
draws
maxpts
probabilities
plays
loosely
outcomes
province
provinces
isconnectedij
isconnected
fingers
ipo
profitsi
soon
venture
capitali
pure
heater
heaters
winter
warmed
candiescounti
candiescount
dailycapi
favoritetypei
favoritedayi
24130
13024
ologm
inequality
resultj
requestsj
gainloss
stockname
operationday
review
rated
createdat
movierating
movieid
voyage
shadow
yz
projection
looking
planes
projections
zx
3-dimensional
3000000
bigint
25000000
twenty-five
continent
gdp
countries
km2
nums1i2
nums1k
nums2k
resr1c-2height-r-1
resr1c2height-r-1
resrc
res0n-12
2height1
sentencesi
candidate
trainers
trainersj
matchings
playersi
trainer
restaurantsi
vegan-friendly
veganfriendlyi
veganfriendly
maxprice
filters
cx
garbled
towers
towersi
qi
cy
qualities
toggle
rulekey
namei
rulevalue
yqueeni
queensi
ad
xking
xqueeni
yking
southwest
reflection
receptors
ray
receptor
mirrors
535e93
-123456e789
1a
2e10
-01
0089
6e-1
1e
e3
95a54e53
314
-90e3
3e7
99e25
--6
abcdefghijklmnop
ab121p
cdefghijklmn
arbitrarily
routesi
routes0
cutsi
boxtypesi
numberofunitsperboxi
trucksize
boxtypes
numberofboxesi
features
wrapper
arraywrapper
cashbacki
boats
boat
defuse
code0
coden-1
informer
unfairness
cookiesi
rev120
revnumsi
rev123
revx
revnumsj
younger
conflicts
basketball
histogram
histograms
arry
arrx
numsnumsnumsk
numsnumsk
freeint
freed
allocateint
functionalities
allocator
allocatorint
uploaded
luprefix
uploads
luprefixint
uploadint
upload
arranging
twins
n-1-ith
twin
farm
strict
-numsi
negations
subtracted
diffi
particularly
neighborhoods
12233211
neighborhood
sideway
lanes
obstacles2
lane
negabinary
-22
-20
-23
autoincrement
rents
unrented
shopi
searching
entriesi
movierentingsystem
generating
rental
rent
resj
movierentingsystemint
moviei
dropint
renting
shops
moviej
shopj
listlistinteger
rentint
11001
12312
asteroidsi
destroying
planet
incur
closes
abcabc
sright
sleft
encodedstring
3a
kencodedstring
descriptionsi
descriptions
islefti
childi
widthiheighti
width-to-height
interchangeable
widthjheightj
043
kitchen
callpolyfill
taxprice
consolelogthe
enhance
totalcost
taxcallpolyfillitem
tax10
obj
taxrate
thisitem
functioncall
salad
appropriately
artyom
skiplist
comparing
httpsenwikipediaorgwikiskiplist
cc
wikimedia
ologn
idea
by-sa
304050607090
fine
kalinin
treap
commons
eraseint
comparatively
skiplists
red-black
thorn
formulas
atoms
h2o2he3mg4
h2o23
h2o2
h1o2
atomic
atom
chemical
endpos
gravity
side-view
inertia
boxs
reservedseats
aisle
38
allocation
exceptional
reservedseatsi
four-person
comid
commissionrate
salesperson
salesid
alongside
commission
hiredate
salespersons
prefixi
well-spaced
neededapples
ocurrences
warmer
zero-filled
deci-binary
3001
112
lastname
combine
firstname
addressid
assumes
raised
shiftsi-1
shiftx
shiftc
left-out
alter
k-group
out-of-order
alal1ar
boards
redirect
stuck
redirects
upgradeint
locking
unlocked
lockint
prevents
upgraded
lockingtree
upgrade
unlockint
lockingtreeint
strs0
strs2
strs1
strsn
edgelist
disi
qj
edgelisti
existence
scoreij
exams
expends
forces
fallen
purposes
upright
lisp
vn
en
syntax
mult
lisp-like
expr
scope
scopes
originali
original0
derivedi
bij
sized
maxbik
numsij
typesi
indistinguishable
counti
marksi
findmedian
medianfinder
insertions
buddy
cbad
treenodeval
treenodeleft
recovered
findelements
recovers
treenoderight
treenoderightval
findelementstreenode
treenodeleftval
k-length
numsik
heroes
minnumsi0
maxnumsi0
numsik2
extremely
pow
today
73412
stockspanner
todays
quotes
7212
span
hills
valley
valleys
hill
fly
flying
interview
acosti
bcosti
convertstring
legibility
font
pahnaplsiigyir
paypalishiring
ccs
myatoistring
0032
clamped
clamp
atoi
imageij
sr
pixel
sc
imagesrsc
1112131415
sumarr
sumnums2
nums1leftright
sumnums1
1121345
nums2leftright
spliced
11231415
transposition
slanted
depict
encodedtext
ciphertext
pr
accessed
originaltext
tap
watered
taps
one-dimensional
12321
dislikes
dislike
bipartition
dislikesi
capacityi
rocks
additionalrocks
rocksi
1440
exits
intime
outtime
eventday
repetitively
1351315
551
blockedi
0130
0015
logouttime
midnight
0045
2345
logintime
seventh
logout
logins
thinking
dining
silent
philosophers
spaghetti
wikipediaorg
demand
philosopher
concurrent
putleftfork
wantstoeatphilosopher
starve
pickleftfork
discipline
fork
forks
bowls
pickrightfork
putrightfork
think
asking
behaviour
stomach
thin
246
segmentsi
47
1412477
leftj
rightj
rather
mixj
mix
paintingj
145177
unmodified
verbal
license
arrm
stronger
2d-map
xcentre
centre
ycentre
favorites
favoritecompanies
favoritecompaniesi
companies
pizzas
forgotten
adjacentpairs
adjacentpairsi
semesters
nextcoursei
semester
prevcoursei
relationsi
001101
official
variety
inspection
travellers
travelleddistance
constrained
r3g2b1
rod
color-position
carpet
size-2
4-3
size-4
packaging
boxesj
8-5
size-8
supplier
4-2
suppliers
size-5
packagesi
size-3
48
countsi
gx
fghx
hx
identity
fnx
tm
t3
interleaving
nums3k
nums4l
nums4
transferint
withdrawn
account2
balancei
account1
banklong
automate
wealth
accountsij
parties
senators
announce
dire
senate
rights
dota2
voting
ban
exercise
senator
victory
radiant
round-based
presence
gcdnumsi
subgrids
seq0
seq1
seqk
forwardbackward
numsseqj
0124445667
4566701244
2p
0011
1111
ababc
mystack
lifo
last-in-first-out
numsansi
coprimes
unidirectional
confirmed
confirmation
expired
confirmations
confirming
requested
timeout
signup
signups
circuit
gasi
listing
labeling
suggests
suggestions
suggested
ologarrlength
minstack
getmin
retrieving
changenumi
mutating
cornered
exclusively
text1
text2
pos2x
pos2z
pos1z
pos1v
pos1x
pos2v
pos2y
pos1y
isomorphic
numsliri
52372
guardsi
wallsj
obstructed
guard
unguarded
x1x2xny1y2yn
x1y1x2y2xnyn
escaped
backslash
mycalendar
minnumsi
supervisor
nucleotides
10-letter-long
useful
acgaattccg
dna
studying
000
ambiguous
extraneous
205
length-3
016666
212
repeatingpart
integerpartnonrepeatingpartrepeatingpart
integerpartnonrepeatingpart
016
1230001
016666666
nonrepeatingpart
portion
conventionally
123001212
integerpart
searched
multiplying
care
5489355142
5489355421
5489355412
5489355214
5489355241
smallest-valued
recolors
recolor
blocksi
peekingiterator
peeking
peekingiteratoriteratorint
uam
by1
by2
rectilinear
ax1
ax2
bx1
ay2
ay1
bx2
u1
vk
uk
u2
39916800
f11
preimage
convention
minb
belonged
remembers
loweri
higheri
basically
stages
numerator
recurring
enclose
wagei
wage
expectation
qualityi
enqueuetimei
act
processingtimei
bottom-up
substituted
substitution
appearance
segmented
enclaves
transport
orient
reorienting
ministry
narrow
createhelloworld
countintervals
factoryj
factories
roboti
positionj
repairs
arrivaltime
24-hours
delayedtime
sticker
stickers
anti-theft
activated
beams
while1
banki
devices
beam
solitaire
dest
src1
lastly
src2
constituent
buildingsi
absolutely
silhouette
x1y1x2y2
termination
511
grounded
skylines
geometric
collectively
512
obviously
crossed
colsumi
column0-indexed
1-stlower
2-row
0-thupper
completion
ramp
sits
examroom
examroomint
leaveint
alicezleetcodecom
emailsi
myemailcom
mynameemailcom
aliceleetcodecom
forwarded
mails
everything
studentsi
student-mentor
mentor
survey
achieved
compatibility
mentorsj
mentors
yielding
encounters
camelcase
todelete
non-repeating
storekeeper
blooming
growtime
blooms
seeds
growtimei
bloomed
planttime
planttimei
addcarint
park
medium
parkingsystemint
parkingsystem
cartype
parking
cnumselect
numselect
terminates
unvisited
passengersj
busesi
vacant
prison
shiftt
shiftz
railway
stationname
underground
checkin
endstation
undergroundsystem
chronological
startstation
checkinint
getaveragetime
getaveragetimestring
checkout
checkoutint
toggling
457
333
k-booking
mycalendarthree
cubic
storeroom
cube
nonempty
primitive
pk
outermost
suffixes
newprice
changedate
2019-08-16
achievable
season
operationsi
baseball
arr1j
arr2i
nummatrix
sumregion
nummatrixint
sumregionint
mud
r1i
extracted
dig
r2i
buried
artifacts
artifactsi
excavate
underneath
uncovered
c1i
artifact
digi
c2i
echo
jane
sentence2
sentence1
heaviest
querying
queried
addstring
ordinal
scenic
attractiveness
invoked
invocation
sortracker
prepare
prepares
distancetolastnodezi1
distancetolastnodex
z2
zi
distancetolastnodezi
zi1
zk
z1
z0
combinationiteratorstring
combinationiterator
combinationlength
3951
6345
0158
cycled
3456
unnecessary
sender
chat
messagesi
senders
sendersi
abssum
constructai
constructa0
constructa
constructb
flipsi
prefix-aligned
majoritycheckerint
majoritychecker
assorted
wallet
discovers
aware
discovering
forget
colsumj
rowsum
rowsumlength
colsumlength
rowsumi
fulfills
10101
k-increasing
arr5
arr3
arri-k
arr4
heshe
oct
31st
aug
dd
jan
feb
dec
apr
jun
mar
2100
yyyy
jul
30th
1900
nov
sep
neededtimei
colorful
neededtime
lcpij
lcp
aaca
wordjn-1
aabd
wordin-1
128
self-dividing
minai
bn
nums2ik
nums1i1
nums1ik
minnums2i0
nums1i0
leds
watch
0-59
led
pm
0-11
1002
451
turnedon
121000
102001
logarithmic
firstperson
secrets
maxnums2
minnums2
setting
setkey
overwritten
un-expired
inaccessible
getkey
gcdval1
validly
switch
couple
couples
maxletters
minsize
sublists
sublist
decompress
decompressed
153
beautyi
ca
aca
abaca
262124
zbax
arrlen
peoples
bronze
athletes
scorei
silver
medal
athlete
presufec
abbreviate
546
1234567
pre
abbreviating
suf
1234554321
1234567654321
12345678987600000
presuf
1234589876e5
ts
falses
answerkeyi
truefalse
answerkey
maximizing
confuse
trues
confusion
divisorsi
sidelengthi
brushing
landed
freezes
rangefreqquery
rangefreqqueryint
against
secondplayer
compete
winners
competes
firstplayer
sells
tastiness
grid1
sub-island
sub-islands
grid2
leaf-similar
eeecd
sourcesi
abbc
sources
testcase
targetsi
tright
tleft
substitutions
bulky
heavy
categorize
signals
base-k
base-2
2-mirror
contrary
k-mirror
base-10
datastreamint
consecint
datastream
exchanges
secondlen
firstlen
lyb
queries2
queries4
palidrome
falsetrue
abba
010221
baab
queries1
queries3
abcda
queries0
330120031032041
truefalsefalsetruetrue
valuesj
sightseeing
spot
spots
monotonic
transitive
friendship
friendshipsi
languagesi
teach
friendships
infrastructure
onlogn
variance
minesi
relevant
gridxiyi
arms
pillow
streak
12335
1235
min2
instructionsi
1-dimensional
matrixes
quad-trees
quadtree1
quadtree2
no-zero
sleep
sleeps
millis
typewriter
array-like
getindex
snapshot
snapshotarrayint
snapshotarray
setindex
snapid
snap
toeplitz
beautifully
rowindexth
rowindex
frequencytracker
hasfrequencyint
regarding
deleteoneint
cardpoints
registered
username
contestid
decimals
register
directioni
sremovablei
removablelength
removable
alone
mirrored
subroot
roomidi
absid
sizei
minsizej
hotel
preferredj
entrancerow
entrancecol
patiencei
originating
resend
patience
resending
channels
periodically
replies
channel
x--
--x
answerrowcol
rankq
rankp
left-justified
maxwidth
greedy
justified
